/*******************************************************************
 * Simple BlynkGO Template
 *  Template สำหรับเริ่มสร้างโปรเจคใหม่
 *  ขั้นตอน
 *    1. ให้ save เป็น ชื่อโปรเจคที่ต้องการต่างหาก
 *    2. ปรับ compile option ใน blynkgo_config.h ให้เรียบร้อย
 *    3. จากนั้นให้กด compile รอบแรกเสียก่อนค่อยสร้างโปรเจคที่ต้องการ แล้วรอสักครู่ 
 *       (การคอมไพล์รอบแรกจะใช้เวลาสักพัก)
 *    4. เริ่มสรางโปรเจคที่ต้องการ
 *       (การคอมไพล์รอบถัดๆไปจะเร็วขึ้น)
 *******************************************************************/

#include <BlynkGOv3.h>	// เรียกใช้ไลบรารี่ BlynkGOv3

void setup() {
  Serial.begin(115200); Serial.println();
  BlynkGO.begin();    	// เริ่มต้นการใช้งาน BlynkGO


}

void loop() {
  BlynkGO.update();   	// ให้มีเสมอ โดยวางไว้ใน loop()

}

